In [1]:
import pandas as pd 

df=pd.DataFrame({'Chr':[9,9,9,9,9],'Pos':[38342,38342,40166,40205,42365],
                'Ratio':[0.627660,0.675214,0.627451,0.648352,0.57578],'Depth':[94,117,102,91,99]})

In [2]:
df

   Chr    Pos     Ratio  Depth
0    9  38342  0.627660     94
1    9  38342  0.675214    117
2    9  40166  0.627451    102
3    9  40205  0.648352     91
4    9  42365  0.575780     99

In [3]:
df['new']=['Depth %i' %i for i in df['Depth'] ]
df

   Chr    Pos     Ratio  Depth        new
0    9  38342  0.627660     94   Depth 94
1    9  38342  0.675214    117  Depth 117
2    9  40166  0.627451    102  Depth 102
3    9  40205  0.648352     91   Depth 91
4    9  42365  0.575780     99   Depth 99

In [17]:
os.chdir(r'd:/test1')
data=pd.read_excel('./data.xlsx',dtype=str)
data

           id                          code  a9 a10 a11
0  3025769188   辽中镇北四路2-20号盛世御景20号楼-1单元9层2号  -1   9   2
1  3025769189  辽中镇北四路2-20号盛世御景20号楼-1单元10层2号  -1  10   2
2  3025769190  辽中镇北四路2-20号盛世御景20号楼-1单元11层2号  -1  11   2
3  3025769191   辽中镇北四路2-20号盛世御景20号楼-2单元1层1号  -2   1   1

In [18]:
df1.dtypes

id      object
code    object
a9      object
a10     object
a11     object
dtype: object

In [19]:
data['a9']=data['a9'] + ' 单元'
data

           id                          code     a9 a10 a11
0  3025769188   辽中镇北四路2-20号盛世御景20号楼-1单元9层2号  -1 单元   9   2
1  3025769189  辽中镇北四路2-20号盛世御景20号楼-1单元10层2号  -1 单元  10   2
2  3025769190  辽中镇北四路2-20号盛世御景20号楼-1单元11层2号  -1 单元  11   2
3  3025769191   辽中镇北四路2-20号盛世御景20号楼-2单元1层1号  -2 单元   1   1

## 添加新的列：

In [20]:
data['m'] = data['code'].str[:4]

In [21]:
data

           id                          code     a9 a10 a11     m
0  3025769188   辽中镇北四路2-20号盛世御景20号楼-1单元9层2号  -1 单元   9   2  辽中镇北
1  3025769189  辽中镇北四路2-20号盛世御景20号楼-1单元10层2号  -1 单元  10   2  辽中镇北
2  3025769190  辽中镇北四路2-20号盛世御景20号楼-1单元11层2号  -1 单元  11   2  辽中镇北
3  3025769191   辽中镇北四路2-20号盛世御景20号楼-2单元1层1号  -2 单元   1   1  辽中镇北

In [22]:
# 如果用dtype=str
# 加载表文件 或将列类型转换为字符串df['a'] = df['a'].astype(str)
# 然后您可以使用这样的方法：
data['a9']='col' + data['a9'].str[:]

In [23]:
data

           id                          code        a9 a10 a11     m
0  3025769188   辽中镇北四路2-20号盛世御景20号楼-1单元9层2号  col-1 单元   9   2  辽中镇北
1  3025769189  辽中镇北四路2-20号盛世御景20号楼-1单元10层2号  col-1 单元  10   2  辽中镇北
2  3025769190  辽中镇北四路2-20号盛世御景20号楼-1单元11层2号  col-1 单元  11   2  辽中镇北
3  3025769191   辽中镇北四路2-20号盛世御景20号楼-2单元1层1号  col-2 单元   1   1  辽中镇北

In [24]:
data['a9'] = 'str' + data['a9'].astype(str)

In [25]:
data

           id                          code           a9 a10 a11     m
0  3025769188   辽中镇北四路2-20号盛世御景20号楼-1单元9层2号  strcol-1 单元   9   2  辽中镇北
1  3025769189  辽中镇北四路2-20号盛世御景20号楼-1单元10层2号  strcol-1 单元  10   2  辽中镇北
2  3025769190  辽中镇北四路2-20号盛世御景20号楼-1单元11层2号  strcol-1 单元  11   2  辽中镇北
3  3025769191   辽中镇北四路2-20号盛世御景20号楼-2单元1层1号  strcol-2 单元   1   1  辽中镇北

In [26]:
df = pd.DataFrame({'col':['a',0]})
df

  col
0   a
1   0

In [27]:
df['col'] = 'str' + df['col'].astype(str)
df

    col
0  stra
1  str0

作为替代方案，您还可以使用apply与format结合使用（或更好地与f字符串结合使用），如果您还想添加后缀或操作元素本身，我会发现它的可读性稍高一些：

In [28]:
df = pd.DataFrame({'col':['a', 0]})

df['col'] = df['col'].apply(lambda x: "{}{}".format('str', x))

In [29]:
df

    col
0  stra
1  str0

In [30]:
df['col'] = df['col'].apply(lambda x: f"str{x}")

In [31]:
df

       col
0  strstra
1  strstr0

In [32]:
df = pd.DataFrame({'col':['a', 0]*200000})

In [33]:
df

       col
0        a
1        0
2        a
3        0
4        a
...     ..
399995   0
399996   a
399997   0
399998   a
399999   0

[400000 rows x 1 columns]

In [34]:
%timeit df['col'].apply(lambda x: f"str{x}")

425 ms ± 12.1 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [35]:
df

       col
0        a
1        0
2        a
3        0
4        a
...     ..
399995   0
399996   a
399997   0
399998   a
399999   0

[400000 rows x 1 columns]

In [36]:
%timeit 'str' + df['col'].astype(str)

417 ms ± 31.3 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [37]:
df

       col
0        a
1        0
2        a
3        0
4        a
...     ..
399995   0
399996   a
399997   0
399998   a
399999   0

[400000 rows x 1 columns]